const fs = require('fs');

const rawCSV = `114,114005,國王陛下回來前的100秒！,9789579077767,2020/01/07,小魯文化,柏原佳世子,,劉握瑜,白標,1
114,114004,貓咪跳進去了！,9789865357078,2021/05,采實文化,小森香折,植垣步子,,白標,1
114,114003,我愛睏,9786267295359,2025/05/01,格林文化,安德烈波卡,幾米,安德烈波卡,白標,1
114,114002,這樣做沒禮貌！,9789575214524,2021/3/1,東方出版社,貝絲·布拉肯(Beth Bracken),理查·華生(Richard Watson),李貞慧,白標,1
114,114001,一顆又大又好吃的地瓜,9789864005574,2024/08/10,道聲出版社,卡塔琳娜·馬庫羅娃 (Katarina Macurova),卡塔琳娜·馬庫羅娃 (Katarina Macurova),黃新智,白標,1
113,113005,去散步,9789576420627,2009/11/12,信誼基金,林明子,,曾淑兆,白標,1
113,113004,親愛的動物園,9789577622426,2001/07/15,上誼文化,羅德·坎貝爾(Rod Campbell),羅德·坎貝爾(Rod Campbell),陳愛蓮,白標,1
113,113003,陶樂蒂的開學日,9789579095808,2018/08/03,親子天下,陶樂蒂,,陶樂蒂,白標,1
113,113002,小種子與大怪獸,9786267350034,2023/08/01,小熊出版,蔡兆倫,蔡兆倫,,白標,1
113,113001,可以一起玩嗎？,4713269124108,2023/05/01,格林文化,麥克·布朗羅(Mike Brownlow),麥克·布朗羅 (Mike Brownlow),黃聿君,白標,1
112,112005,會生氣的山,9789864793648,2018-02-05,小天下,陶樂蒂,陶樂蒂,,白標,1
112,112004,大狗大貓的相處之道,9786263053908,2023-01-17,親子天下,尤塔·鮑爾(Jutta Bauer),尤塔·鮑爾(Jutta Bauer),黃珮芬,白標,1
112,112003,九隻小貓,9789861616797,2022-07-01,信誼基金出版社,張哲銘,張哲銘,,白標,1
112,112002,恐龍生氣的秘密,9786267140581,2022-08-24,小光點,津村帕帕tsumupapa,津村帕帕tsumupapa,陳瀅如,白標,1
112,112001,媽媽，不要，怪獸來了,9789869987585,2021-08-25,維京國際,伊蘭·布倫曼(Ilan Brenman),吉列爾梅·卡斯滕(Guilherme Karsten),張家綺,白標,1
110,110005,我和同學吵架了,9789863712190,2020-07-01,和平國際,張輝誠,張輝誠,張輝誠,白標,1
110,110004,上學去嘍！：看看別人，想想優秀的自己！,9789571197326,2018-06-28,五南,馬特·羅伯森(Matt Robertson),馬特·羅伯森,,白標,1
110,110003,晚安，我的小恐龍,9789864403028,2020-07-01,采實,瑪麗·沃伊特(Marie Voigt),瑪麗·沃伊特,黃婷涵,白標,1
110,110002,飛吧！波波,9789865664299,2017-03-01,三之三,安娜·沃克(Anna Walker),安娜·沃克,黃又青,白標,1
110,110001,小天鵝的夢想,9789579529471,2020-08-01,愛智圖書,賴馬,賴馬,,白標,1
109,109005,長大後想變成什麼呢？,9789862117279,2017-07-28,小魯文化,木村裕一,宮西達也,周姚萍,白標,1
109,109004,我一定要去那裡！,9789869593205,2018-02-06,東方出版社,克莉絲汀·諾曼,查理·華生,李貞慧,白標,1
109,109003,愛生氣的小犀牛,9789578640610,2018-11-14,小光點,陳書韻,宮西達也,柯倩華,白標,1
109,109002,開學第一天,9789869791656,2019-08-07,小光點,凱特·霍夫勒,,陳思穎,白標,1
109,109001,情緒寶盒,9789869561679,2018-06-15,青林國際,Anna Llenas,,青林國際,白標,1
108,108005,我的興趣可以變成我未來的工作,9789579125154,2018-09-05,大塊文化,昆丁·格雷班(Quentin Gréban),,苗德華,白標,1
108,108004,小刺蝟愛生氣,9789575030315,2018-09-07,親子天下,張輝誠,WaHa Huang,,白標,1
108,108003,誰是第一名,9789861615288,2015-10-01,信誼基金出版社,蕭湄羲,蕭湄羲,,白標,1
108,108002,都是我的,9789575030131,2018-09-07,親子天下,張輝誠,林小杯,,白標,1
108,108001,歡迎光臨我的家,9789864793358,2017-12-01,小天下,史考特·曼欽(Scott Menchin),哈利·布里斯,黃又青,白標,1
107,107005,跌倒了,9789862116159,2016-04-01,小魯文化,曹俊彥,大迫綠,陳玉金,白標,1
107,107004,我們來洗澡,9789865664183,2015-10-01,三之三,艾米·諾曼,艾米·諾曼,林良,白標,1
107,107003,神奇魔杖,9789863380368,2014-06-01,台灣麥克,信子,信子,柯倩華,白標,1
107,107002,禮物,9789862412213,2010-11-02,親子天下,安妮·席瓦諾,瑪麗·安德烈,游珮芸,白標,1
107,107001,我的家,9577454569,2004-05-30,格林文化,安德烈波卡,,郝廣才,白標,1
106,106005,神奇畫筆,9789861890128,2017-02-01,格林文化,大衛威斯納,安東尼布朗,郝廣才,白標,1
106,106004,回家了，沒關係,9789577625793,2015-09-01,上誼,羅德·坎貝爾,羅德·坎貝爾,張淑芬,白標,1
106,106003,點點點,9789862121290,2009-09-30,上人,艾力克·巴圖,,劉清彥,白標,1
106,106002,小熊去上學,9789577625397,2013-07-09,上誼,卡門·范登堡,阿諾,林芳萍,白標,1
106,106001,小熊去散步,9789862116623,2016-10-01,小魯文化,信子,信子,陳雅芳,白標,1
105,105005,我的名字,957323274X,1997-06-15,遠流,五味太郎,,林真美,白標,1
105,105004,猜猜看,9789866310966,2013-04-01,采實,宮西達也,宮西達也,林真美,白標,1
105,105003,大象救命,9789866310232,2010-10-01,采實,克里斯·里德爾,克里斯·里德爾,黃筱茵,白標,1
105,105002,好想好想吃餅乾,9789863980582,2015-04-29,親子天下,陶樂蒂,,邱瓊慧,白標,1
105,105001,你會上學校的洗手間嗎？,9789862112076,2011-03-01,小魯文化,村上八千代,瀨邊雅之,周姚萍,白標,1
104,104005,上面和下面,9572089420,2001-12-10,三之三,珍娜·史蒂芬斯,,宋珮,白標,1
104,104004,動物園對不起,9789862113769,2013-06-01,小魯文化,艾力克·巴圖,艾力克·巴圖,劉清彥,白標,1
104,104003,媽媽生氣了：非常、非常生氣,9572089013,2005-06-12,三之三,尤塔·鮑爾,,宋珮,白標,1
104,104002,帕拉帕拉山的妖怪,9789867942272,2005-06-12,和英,賴馬,賴馬,,白標,1
104,104001,借我抱一下,9789867295149,2006-04-20,三之三,信子,,游珮芸,白標,1
103,103005,10隻小狗做了一場好夢,9789866830730,2014-02-07,彩虹,陳致元,陳致元,林真美,白標,1
103,103004,我的小紅球,9789867295811,2011-07-01,三之三,五味太郎,五味太郎,,白標,1
103,103003,晚安，小熊,9789577624901,2010-05-25,上誼,昆廷·布雷克,約翰·伯寧罕,周姚萍,白標,1
103,103002,我變成一隻噴火龍了,9789866608377,2011-04-01,和英,賴馬,,,白標,1
103,103001,棕色的熊，棕色的熊，你在看什麼,9577621902,1999-11-18,上誼,艾瑞·卡爾,,,白標,1
102,102005,聖誕夜奇蹟,9577622178,2000-11-15,上誼,五味太郎,五味太郎,鄭明進,白標,1
102,102004,小紅帽與大野狼,9789861890548,2008-04-01,格林文化,安德烈波卡,安德烈波卡,林良,白標,1
102,102003,我想要,9577457487,2005-06-12,格林文化,安德烈波卡,,郝廣才,白標,1
102,102002,好餓的毛毛蟲,9789573255895,2005-09-01,遠流,艾瑞·卡爾,,林良,白標,1
102,102001,藏在箱子裡的是什麼,957762295X,2002-06-27,上誼,五味太郎,,,白標,1
114,114010,神奇樹屋,9789863208457,2015/12/3,小天下,瑪麗·波·奧斯本,薩爾·莫多卡,周思芸,黑標,2
114,114009,小松鼠找新家,9789861617077,2022/11,信誼基金出版社,張哲銘,張哲銘,,黑標,2
114,114008,誰拿了我的帽子,9789865517564,2021-03-24,小光點,莎拉·羅伯茲(Sarah Roberts),漢娜·佩克(Hannah Peck),黃婷涵,黑標,2
114,114007,如果你種下一棵樹,9786267367209,2024/3/5,大塊文化,羅德里戈·馬蒂奧利 (Rodrigo Mattioli),羅德里戈·馬蒂奧利 (Rodrigo Mattioli),吳愉萱,黑標,2
114,114006,我是小杓子,9789864403776,2021-10-01,采實,艾美·克蘿思·羅森朵(Amy Krouse Rosenthal),史考特·馬谷(Scott Magoon),黃婷涵,黑標,2
113,113010,神奇商店,9789576586538,2021/11/19,三采,吉竹伸介,吉竹伸介,許婷婷,黑標,2
113,113009,給自己的一封信,9786263173231,2021/11/28,五南,查爾斯·桑托索(Charles Santoso),查爾斯·桑托索(Charles Santoso),吳愉萱,黑標,2
113,113008,只要做自己就好！,9789575214807,2021/07/27,東方出版社,蘇珊娜·伊森(Susanna Isern),米蓮·里戈迪(Mylène Rigaudie),黃新智,黑標,2
113,113007,安靜一下下,9786263055025,2023/06/29,親子天下,林小杯,林小杯,,黑標,2
113,113006,我的家人要來了,9789864404759,2023/04/01,采實,陶樂蒂,黃郁欽,陳思穎,黑標,2
112,112010,生氣湯,9789865576134,2021-04-01,格林文化,貝西·艾芙芮,貝西·艾芙芮,柯倩華,黑標,2
112,112009,我不怕，我不要睡覺,9789577624369,2007-07-30,上誼文化公司,蘿倫·柴爾德,,賴慈芸,黑標,2
112,112008,做到了,9789861895314,2022-12-01,格林文化,尚·勒華(Jean Leroy),馬修·莫德(Matthieu Maudet),張淑瓊,黑標,2
112,112007,這個故事裡沒有大野狼,9789575215989,2023-01-12,東方出版社,露·卡特(Lou Carter),黛博拉·奧萊特(Deborah Allwright),李貞慧,黑標,2
112,112006,哲學小學堂5：快一點‧慢一點,9789575030308,2018-09-07,親子天下,張輝誠,許匡匡,,黑標,2
110,110010,可以一起玩嗎(新版),9789578640801,2019-03-13,小光點,賴馬,賴馬,賴馬,黑標,2
110,110009,我的恐龍大朋友,9789863597810,2020-04-01,木馬文化,強·艾吉(Jon Agee),,黃筱茵,黑標,2
110,110008,我是好孩子,9789575213572,2019-07-29,東方出版社,瑪塔·阿特斯(Marta Altés),瑪塔·阿特斯,黃婷涵,黑標,2
110,110007,歡迎光臨口罩動物村,9789575036119,2020-05-27,親子天下,黃郁欽,黃郁欽,,黑標,2
110,110006,你看你，弄得髒兮兮的！,9789865730314,2016-01-30,愛智圖書,賴馬,,,黑標,2
109,109010,我絕對絕對不吃番茄,9789577624352,2007-07-30,上誼文化,蘿倫·柴爾德,,賴慈芸,黑標,2
109,109009,十八隻小豬的新家,9789575213688,2019-09-02,東方出版社,宮西達也,宮西達也,黃婷涵,黑標,2
109,109008,如果我是小鳥,9789862118856,2019-02-01,小魯文化,大衛·夏農,,陳思穎,黑標,2
109,109007,是誰嗯嗯在我的頭上,9578416040,1998-02-01,三之三,維爾納·荷茲瓦特,沃爾夫·埃爾布魯希,方素珍,黑標,2
109,109006,時間長還是短?,9789864490929,2017-11-01,台灣麥克,宮西達也,宮西達也,方素珍,黑標,2
108,108010,開學了，學校也要準備好！,9789864794928,2018-08-01,小天下,亞當·雷克斯(Adam Rex),克里斯汀·羅賓遜(Christian Robinson),柯倩華,黑標,2
108,108009,一張鈔票一百元,9789861898605,2018-07-26,格林文化,郝廣才,朱里安諾(Giuliano Ferri),,黑標,2
108,108008,慌張先生,9789864793440,2018-01-19,小天下,賴馬,賴馬,,黑標,2
108,108007,騎著恐龍去上學,9789869433709,2017-03-03,步步,劉思源,林小杯,,黑標,2
108,108006,垃圾車來了,9789864793228,2017-11-02,小天下,凱特·麥克馬蘭(Kate McMullan),吉姆·麥克馬蘭(Jim McMullan),游珮芸,黑標,2
107,107010,恐龍先生和長頸鹿,9789869443326,2017-06-28,親子天下,陶樂蒂,賴馬,,黑標,2
107,107009,小熊的森林小學,9789577626134,2017-07-14,上誼文化,羅素·霍班,莉蓮·霍班,陳思穎,黑標,2
107,107008,第一次自己坐公車,9789869425018,2017-03-10,大塊文化,土田義晴,,林真美,黑標,2
107,107007,我可以加入你們的樂團嗎,9789865876395,2017-09-15,維京國際,潔西卡·沃德,理查·華生,黃新智,黑標,2
107,107006,愛吃青菜的鱷魚,9789576428289,2016-01-01,信誼基金,湯姆牛,湯姆牛,,黑標,2
106,106010,短耳兔,9789862168820,2012-03-15,小天下,達文茜,,游珮芸,黑標,2
106,106009,猜猜我有多愛你,957762068X,2004-05-31,上誼,山姆·麥克布雷尼,安妮塔·捷朗,梅思繁,黑標,2
106,106008,我的感覺系列-我很生氣,9789867561992,2012-04-03,親子天下,康娜莉雅·史貝蔓,凱西·帕金森,嚴淑女,黑標,2
106,106007,小黃點大冒險,9577621384,1998-03-01,上誼,赫威·托雷(Hervé Tullet),,上誼編輯部,黑標,2
106,106006,慌張先生,9789869354530,2016-08-31,親子天下,賴馬,賴馬,,黑標,2
105,105010,奶奶的記憶森林,9789862419670,2014-10-02,親子天下,崔琡僖,崔琡僖,,黑標,2
105,105009,我的幸運日,9789867295484,2009-01-06,三之三,慶子·凱薩茲,慶子·凱薩茲,宋珮,黑標,2
105,105008,小黃狗生在農場的車庫上,9789577625458,2013-11-26,上誼,宮西達也,宮西達也,柯倩華,黑標,2
105,105007,小心！小紅帽,9789575709600,2011-02-01,台灣麥克,信子,信子,周思芸,黑標,2
105,105006,我永遠愛你,9789866608353,2014-04-01,和英,漢斯·威廉,漢斯·威廉,林芳萍,黑標,2
104,104010,是誰的尾巴？,9578872917,2005-06-12,三之三,大衛·卡特,安東尼·布朗,方素珍,黑標,2
104,104009,愛吃水果的牛,9577621937,2005-06-12,上誼,湯姆牛,湯姆牛,黃又青,黑標,2
104,104008,對不起，我錯怪你了,9789865925567,2015-02-10,大塊文化,宮西達也,宮西達也,劉清彥,黑標,2
104,104007,我不喜歡，這樣對我！,9789866407659,2011-06-03,大塊文化,派翠西亞·波拉蔻,派翠西亞·波拉蔻,黃筱茵,黑標,2
104,104006,我不敢說，我怕被罵,9789865925406,2014-05-12,大塊文化,皮姆·凡赫斯特,妮可·塔斯瑪,謝靜雯,黑標,2
103,103010,短耳兔,9789867158277,2006-02-27,親子天下,達文茜,唐唐,,黑標,2
103,103009,小豬，晚安,9861610596,2005-10-15,信誼,陳致元,,,黑標,2
103,103008,第一百個客人,9577456529,2005-06-12,格林文化,郝廣才,朱里安諾,,黑標,2
103,103007,大象艾瑪(二版),9789862114131,2014-03-01,小魯文化,大衛·麥基,大衛·麥基,周姚萍,黑標,2
103,103006,愛心企鵝,9789862167373,2011-06-03,小天下,珍妮佛·瓊斯,宮西達也,周姚萍,黑標,2
102,102010,最棒的禮物！,9867517598,2005-10-26,上人,賴馬,,林芳萍,黑標,2
102,102009,我永遠愛你,9577621880,2005-06-12,上誼,漢斯·威廉,,林良,黑標,2
102,102008,好大的大象,9577620981,1997-11-01,上誼,五味太郎,,鄭明進,黑標,2
102,102007,好餓的老狼,9789861611846,2007-11-05,信誼,賴馬,賴馬,,黑標,2
102,102006,三隻小豬,9867235258,2006-07-04,大塊文化,大衛威斯納,大衛威斯納,柯倩華,黑標,2`;

console.log("Parsing test list...");
